local Aloft = Aloft
if not Aloft then return end
local AloftModules = AloftModules
if not AloftModules then return end
local AloftLocale = AloftLocale
if not AloftLocale then return end

-----------------------------------------------------------------------------

AloftLocale.AloftFactionFilter = { }
local fL = AloftLocale.AloftFactionFilter

-----------------------------------------------------------------------------

AloftModules:AddInitializer("AloftFaction", function()

-----------------------------------------------------------------------------

local locale = GetLocale()

-----------------------------------------------------------------------------

-- Leave enUS locale active as default locale

--[[ enUS ]] fL["Threat"] = "Threat"
--[[ enUS ]] fL["PvP"]	= "PvP"
--[[ enUS ]] fL["^Requires "] = "^Requires "

-----------------------------------------------------------------------------

end)

-----------------------------------------------------------------------------

if (locale == "koKR") then

-----------------------------------------------------------------------------

AloftModules:AddInitializer("AloftFaction", function()

-----------------------------------------------------------------------------

--[[ koKR ]] fL["Threat"] = "Threat"
--[[ koKR ]] fL["PvP"]	= "PvP"
--[[ koKR ]] fL["^Requires "] = "^Requires "

-----------------------------------------------------------------------------

end)

-----------------------------------------------------------------------------

elseif (locale == "ruRU") then

-----------------------------------------------------------------------------

AloftModules:AddInitializer("AloftFaction", function()

-----------------------------------------------------------------------------

--[[ ruRU ]] fL["Threat"] = "Threat"
--[[ ruRU ]] fL["PvP"]	= "PvP"
--[[ ruRU ]] fL["^Requires "] = "^Requires "

-----------------------------------------------------------------------------

end)

-----------------------------------------------------------------------------

elseif (locale == "zhCN") then

-----------------------------------------------------------------------------

AloftModules:AddInitializer("AloftFaction", function()

-----------------------------------------------------------------------------

--[[ zhCN ]] fL["Threat"] = "Threat"
--[[ zhCN ]] fL["PvP"]	= "PvP"
--[[ zhCN ]] fL["^Requires "] = "^Requires "

-----------------------------------------------------------------------------

end)

-----------------------------------------------------------------------------

elseif (locale == "zhTW") then

-----------------------------------------------------------------------------

AloftModules:AddInitializer("AloftFaction", function()

-----------------------------------------------------------------------------

--[[ zhTW ]] fL["Threat"] = "仇恨"
--[[ zhTW ]] fL["PvP"]	= "PvP"
--[[ zhTW ]] fL["^Requires "] = "^需要 "

-----------------------------------------------------------------------------

end)

-----------------------------------------------------------------------------

end
